TOLLcase3D/0/Ua
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5e-3 0 0);

boundaryField
{
    INLET1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    INLET2
    {
        type            fixedValue;
        value           uniform (0 0 0);		
    }
    OUTLET
    {
        type            UaOutlet;
        value           uniform (0 0 0);
    }
    ALLWALL
    {
        type            noSlip;
    }
    SYMSURFACE
    {
        type            symmetry;
    }
}


// ************************************************************************* //
