TOLLcase3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    INLET1
    {
        type            patch;
        nFaces          400;
        startFace       467200;
    }
    INLET2
    {
        type            patch;
        nFaces          400;
        startFace       467600;
    }
    OUTLET
    {
        type            patch;
        nFaces          800;
        startFace       468000;
    }
    ALLWALL
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          16000;
        startFace       468800;
    }
    SYMSURFACE
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          8000;
        startFace       484800;
    }
)

// ************************************************************************* //
