TOLLcase3D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadystate;
}

gradSchemes
{
    default         Gauss linear;
    grad(C)         leastSquares;
    grad(Ca)        leastSquares;
}

divSchemes
{

    div(phi,U)     bounded Gauss upwind;
    div(-phi,Ua)   bounded Gauss upwind;
    div(-phi,Uc)   bounded Gauss upwind;
    
    
    div(phi,C)     bounded Gauss upwind;
    div(-phi,Ca)   bounded Gauss upwind;
   
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
	
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
fluxRequired
{
    default         no;
    p;
    pa;
    pc;
}
// ************************************************************************* //
